Results/Verifications/S2427/bottleneck-determination/read_only/threads-8/sysbench.log
$ time sysbench --config-file=sysbench.conf --threads=8 oltp_read_only --tables=32 --table-size=1000000 --db-ps-mode=auto --rand-type=u
niform run
sysbench 1.0.20 (using system LuaJIT 2.1.1700206165)

Running the test with following options:
Number of threads: 8
Report intermediate results every 10 second(s)
Initializing random number generator from current time


Initializing worker threads...

Threads started!

[ 10s ] thds: 8 tps: 134.33 qps: 2158.93 (r/w/o: 1889.46/0.00/269.47) lat (ms,95%): 70.55 err/s: 0.00 reconn/s: 0.00
[ 20s ] thds: 8 tps: 141.01 qps: 2253.38 (r/w/o: 1971.37/0.00/282.01) lat (ms,95%): 63.32 err/s: 0.00 reconn/s: 0.00
[ 30s ] thds: 8 tps: 136.80 qps: 2190.10 (r/w/o: 1916.50/0.00/273.60) lat (ms,95%): 71.83 err/s: 0.00 reconn/s: 0.00
[ 40s ] thds: 8 tps: 138.30 qps: 2212.49 (r/w/o: 1935.89/0.00/276.60) lat (ms,95%): 69.29 err/s: 0.00 reconn/s: 0.00
[ 50s ] thds: 8 tps: 138.50 qps: 2218.20 (r/w/o: 1941.20/0.00/277.00) lat (ms,95%): 68.05 err/s: 0.00 reconn/s: 0.00
[ 60s ] thds: 8 tps: 140.50 qps: 2245.51 (r/w/o: 1964.61/0.00/280.90) lat (ms,95%): 65.65 err/s: 0.00 reconn/s: 0.00
[ 70s ] thds: 8 tps: 135.80 qps: 2172.38 (r/w/o: 1900.68/0.00/271.70) lat (ms,95%): 71.83 err/s: 0.00 reconn/s: 0.00
[ 80s ] thds: 8 tps: 134.20 qps: 2148.12 (r/w/o: 1879.72/0.00/268.40) lat (ms,95%): 75.82 err/s: 0.00 reconn/s: 0.00
[ 90s ] thds: 8 tps: 137.20 qps: 2195.19 (r/w/o: 1920.79/0.00/274.40) lat (ms,95%): 66.84 err/s: 0.00 reconn/s: 0.00
[ 100s ] thds: 8 tps: 103.00 qps: 1649.21 (r/w/o: 1443.21/0.00/206.00) lat (ms,95%): 114.72 err/s: 0.00 reconn/s: 0.00
SQL statistics:
    queries performed:
        read:                            187670
        write:                           0
        other:                           26810
        total:                           214480
    transactions:                        13405  (133.87 per sec.)
    queries:                             214480 (2141.99 per sec.)
    ignored errors:                      0      (0.00 per sec.)
    reconnects:                          0      (0.00 per sec.)

General statistics:
    total time:                          100.1266s
    total number of events:              13405

Latency (ms):
         min:                                   45.03
         avg:                                   59.72
         max:                                  313.96
         95th percentile:                       78.60
         sum:                               800517.36

Threads fairness:
    events (avg/stddev):           1675.6250/1.87
    execution time (avg/stddev):   100.0647/0.03


real    1m40.380s
user    0m9.592s
sys     0m12.549s